## Flyby table

In [1]:
%load_ext sql

In [3]:
from getpass import getpass

In [9]:
user = 'postgres'
pw = getpass()
host = 'localhost'
port = '5432'
db_name = 'enceladus'
conn_str = f'postgresql://{user}:{pw}@{host}:{port}/{db_name}'

 ········

In [10]:
%sql $conn_str

In [11]:
%%sql
with lows_by_weeks as 
    (select 
        min(altitude) as alt
    from flyby_altitudes
    group by year, week 
    ), 
nadirs as (
    select 
        f.time_stamp,
        l.alt
    from lows_by_weeks l
    inner join flyby_altitudes f
    on l.alt = f.altitude
)
select 
    min(time_stamp) + (max(time_stamp) - min(time_stamp))/2 time_stamp_avg,
    alt
from nadirs
group by 
    alt -- don't group by dates a second time
order by time_stamp_avg;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[(datetime.datetime(2005, 2, 17, 3, 30, 12, 119000), Decimal('1272.075')),
 (datetime.datetime(2005, 3, 9, 9, 8, 3, 472500), Decimal('500.370')),
 (datetime.datetime(2005, 7, 14, 19, 55, 22, 330000), Decimal('168.012')),
 (datetime.datetime(2008, 3, 12, 19, 6, 11, 509000), Decimal('50.292')),
 (datetime.datetime(2008, 8, 11, 21, 6, 18, 574000), Decimal('53.353')),
 (datetime.datetime(2008, 10, 9, 19, 6, 39, 724000), Decimal('28.576')),
 (datetime.datetime(2008, 10, 31, 17, 14, 51, 429000), Decimal('173.044')),
 (datetime.datetime(2009, 11, 21, 2, 9, 56, 371000), Decimal('1596.561')),
 (datetime.datetime(2010, 5, 18, 6, 4, 40, 301000), Decimal('437.292')),
 (datetime.datetime(2010, 8, 13, 22, 30, 51, 975000), Decimal('2555.180')),
 (datetime.datetime(2010, 10, 17, 10, 47, 11, 762000), Decimal('98.901')),
 (datetime.datetime(2010, 11, 30, 11, 53, 59, 49000), Decimal('45.699')),
 (datetime.datetime(2010, 12, 21, 1, 8, 27, 146000), Decimal('48.324')),
 (datetime.datetime(2011, 4, 21, 18, 56, 21, 275000), Decimal('3771.195')),
 (datetime.datetime(2011, 10, 1, 13, 52, 25, 698000), Decimal('98.898')),
 (datetime.datetime(2011, 10, 19, 9, 22, 11, 224500), Decimal('1230.674')),
 (datetime.datetime(2011, 11, 6, 4, 58, 53, 480500), Decimal('496.603')),
 (datetime.datetime(2012, 3, 27, 18, 30, 8, 975000), Decimal('74.165')),
 (datetime.datetime(2012, 4, 14, 14, 1, 37, 811000), Decimal('74.100')),
 (datetime.datetime(2012, 5, 2, 9, 31, 28, 949000), Decimal('73.134')),
 (datetime.datetime(2015, 10, 14, 10, 41, 28, 976500), Decimal('1844.230')),
 (datetime.datetime(2015, 10, 28, 15, 22, 41, 550000), Decimal('49.010')),
 (datetime.datetime(2015, 12, 19, 17, 49, 16, 113500), Decimal('5000.200'))]